print("Іванова Євгенія Сергіївна\nЛабораторна робота№1\nВаріант3\n1 Обчислення гіпотенузи, периметра і площі трикутника")
while True:
    d = str(input("Введіть yes якщо хочете виконати розрахунки:"))
    if d == "yes":
        a = float(input("Введіть довжину катета 1: "))
        b = float(input("Введіть довжину катета 2: "))
        if a > 0 and b > 0:
            c = (a**2 + b**2)**(1/2)
            p = a+b+c
            s = (a*b)/2
            print("Гіпотенуза: "'%.10f' % c)
            print("Периметр: "'%.10f' % p)
            print("Площа: "'%.10f' % s)
        else:
            print("Помилка, некоректні дані")
    else:
        raise SystemExit



